{
  "video_id": "7489110718399139115",
  "video_url": "https://www.tiktok.com/@knowledge.drip/video/7489110718399139115",
  "publish_date": "4-3",
  "comment_groups": [
    {
      "user": ".",
      "comments": [
        "tsmc was building factories in the US before trump thanks to the chips act passed under Biden."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": ".32k",
      "comments": [
        "tsmc deal was before Trump right? Biden incentives deal thing"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "40",
      "comments": [
        "you fell for his word vomit. his calculations of other nations tariffs aren’t their tariffs, its net exports over imports. they can’t lower that number by lowering tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "78✝️",
      "comments": [
        "Wait so its working???"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "ALLEN",
      "comments": [
        "My boy is a genius"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Alex",
      "comments": [
        "I’m more then okay wjth the economy dropping for a few years for it to prosper in the long term."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "B",
      "comments": [
        "So we’re supporting sweatshops and exploiting cheap labor now?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "BMD2988",
      "comments": [
        "Everybody is re-negotiating. We’ll be ight"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Balatro",
      "comments": [
        "Wrong! It’s not the average tariff rate of other countries it’s the trade deficit rate with those countries. If you buy from a store but they haven’t bought from you that’s a trade deficit"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Black _Flame",
      "comments": [
        "Nobody is building a factory when in 4 years, this could be reversed. Imagine spending millions only to have tariffs cut & now you can't compete in the market."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Byrdistheword24",
      "comments": [
        NaN
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Carter Frank",
      "comments": [
        "Yes they’re investing in plants that will not be constructed until 2 terms after trumps presidency. Lithography machines are not cheap but yes they are not labor intensive which is true"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Cheddar._",
      "comments": [
        "Too anyone who thinks the entire country is gonna collapse, remember this phrase. Nothing Ever Happens."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Chris McKee",
      "comments": [
        "I’m willing to wait it out, not sure how bad it will get before it gets better but I do believe that long term this could work for us."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Cjksaa",
      "comments": [
        "Their \"magic math\" is stuff irrelevant to tariffs. Our \"reciprocal\" tariffs are often higher than the other country's real tariff rate."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Correctmeifimwronggamesedition",
      "comments": [
        "chopped filter perma"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Creepy_milk",
      "comments": [
        "The problem is. A majority of these are not based off of the tariff rate, but the trade deficit. So a nation profiting from free trade just gets ecomically attacked for no reason."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Cristian Agustin",
      "comments": [
        "tsmc made plans to build a plant in the US before Trump tariffs, from 2020 when construction beginning in 2024, tariffs was not the sole reason for them to build plants in the US"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Cristian without an h",
      "comments": [
        "Reciprocal*"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Crob Rave",
      "comments": [
        "man if only there was a way to place these tariffs on only specific types of products"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Davis254032",
      "comments": [
        "do you really care about the people or is it just the only counter argument"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "FatArabBoy",
      "comments": [
        "We need to strengthen American goods again instead of relying on imported goods, Biden made it impossible for manufacturers to maintain their production in the US"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "FordLarquadd",
      "comments": [
        "The problem is that they didn’t calculate other countries average Tariffs. He basically just pulled the numbers out of his ass"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "HiMeKevin",
      "comments": [
        "He’s also going to negotiate with other countries for them to lower their tariffs and we’ll lower ours he doesn’t plan on making all the tariffs permanent"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "HyrumAshby",
      "comments": [
        "Except it’s not based of tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "IHaveRabies🧸🐻🎓💔🟥👑💽🟧🏔️",
      "comments": [
        "Trump's tariffs are already working aged like milk💔"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Insideblock",
      "comments": [
        "This would make sense if the \"calculation\" you're talking about actually measured a countries tariff rate on America."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jahamas",
      "comments": [
        "this isn't how they calculated the tarrifs, they used the trade deficit. good video tho"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jordan M",
      "comments": [
        "Yeah so that’s not at all how they based the tariff % it’s based on the trade deficit"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "JuJu",
      "comments": [
        "If trumps tariff plans are successful, another republican president will be elected, and the tariffs won’t change"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Justin",
      "comments": [
        "You’re wrong no one has calculated the “average tariff” the list of “average tariffs” the White House released is simply the trade ratio between us and other countries they labeled them tariffs to confuse people"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Katie",
      "comments": [
        "Good information. Many people are banking on those physical manufacturing jobs to be brought back in hopes of a job."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Khilji10.69",
      "comments": [
        "I like that you are doing pros and cons instead of either fear mongering or glazing trump"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "KitKat",
      "comments": [
        "They aren’t tariffing us, it’s just the trade deficit, since we are the largest consumer market, we have high trade deficits which isn’t even bad"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Knowledge Drip · 创作者",
      "comments": [
        "Appreciate you. Just posted the negative side, check it out and lmk what you think!",
        "That’s an interesting point I hadn’t considered!",
        "Well trillions in stock market equity have been wiped already so that’s something",
        "Haha yeah I recorded this almost immediately after the announcement before the real absolutely ridiculous formula they used came out, but I had a feeling so I said “magic” 😂",
        "I mention some of the negative costs to these tariffs on part 2 that’s posted on my profile if you’re curious about the other side of the argument!",
        "This is true! However they also expanded those initial investments by another 100 billion in response to the tariffs. But I primarily used that example to highlight the type of manufacturing that is the most reasonable to onshore back to the US.",
        "Yes the “magic” math used here was quite ridiculous. I’ll have another video on how flawed it is later.",
        "Yep the math is absolute nonsense, the video was recorded immediately after the announcement and before the very flawed math was revealed.",
        "I’m a crazy kinda guy 🤫",
        "What about it? The US is a service based economy not a manufacturing based one. Services are much profitable and allow us to use our increased purchasing power to offshore manufacturing to cheaper countries for our benefit, leaving US citizens relatively much richer than global counterparts. Sure we can hurt the economy to prop up our domestic manufacturing, but those policies will at the same time reduce the global relative purchasing power of the American citizen.",
        "Video was recorded immediately after the announcement, yes it has since come out that the rates are based on multiple of the trade deficit",
        "Yep you’re right! it was recorded before the formula came out, hence why I said “magic” formula at the time"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Lagg",
      "comments": [
        "how dare he pressure companies into creating jobs in our own country"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "LeBron Glazer (Bronsexual)",
      "comments": [
        "The math wasn’t on their tariff for us, it was based on our trade deficit, which is not a good metric to set tariffs on because as the richer nation, we naturally buy more"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Levi",
      "comments": [
        "American products still use items and materials outside of America. Advancing the price even more",
        "We don’t have the land for these mines like some countries do. Member the means of production. Simple economics. People get the upper hand if they have a lot of one of them."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Lio",
      "comments": [
        "So tariffs are basically a scare tactic?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Matt Bierly",
      "comments": [
        "We still get tax dollars from these plants even if they’re not hiring a ton of employees. Also like you said China pays their workers horribly and a lot of them are kids, if you’re in support of that"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Max",
      "comments": [
        "Almost like exactly what he’s said?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "MillerFouts",
      "comments": [
        "Vietnam is dropping 90% down to 0%. Europe is dropping from 10% on automobiles to 2.5%. They are working. People just aren't paying attention"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "MouseketeerVibes",
      "comments": [
        "This is why trump is saying he’s running a third term, so companies get scared and move, he isn’t really trying to run a third time"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mystic.Mire",
      "comments": [
        "I love how the same people who want to raise the minimum wage won't buy Nintendo games for 10 more dollars"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "NoxNap",
      "comments": [
        "tsmc was happening way before Trump."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Owen",
      "comments": [
        "Aren’t the tariffs based on the trade deficit since some countries have more or less than half of what they tariff us?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "PlatinumWolf45",
      "comments": [
        "Just buy American products, not that hard"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Purple_vertical2",
      "comments": [
        "Thank God someone is explaining this. because so many people just see a low economy then call Trump the worst president, but in reality he's gonna create a good economy in the long run."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Renno",
      "comments": [
        "You’re wrong he’s measuring the trade DEFICIT not the % of tariffs the other country impose. 🤦🏻‍♂️"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Robert",
      "comments": [
        "Are you gonna mention the magic math is actually just trade deficit/exports ? No magic and definitely no math"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ryancito",
      "comments": [
        "How about the trade deficit?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Shawn Obrien",
      "comments": [
        "I think if we stopped allowing other countries to expose child labor and horrible working conditions. This could work a lot better.",
        "No just stop buying from them."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "SirSigmaLot",
      "comments": [
        "I love seeing people figure out what tariffs do"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Smoke fyinfo",
      "comments": [
        "what send Delta Force and Navy seals to raid factories thats gonna cause to many problems"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Starboyy23",
      "comments": [
        "The Chinese kids will go hunger if we stop buying Nikes. People underestimate how important the American economy is to the world. Not only the consumerism. The US can fix certain markets."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Syx the professional idiot",
      "comments": [
        "I mean I knew this when I voted for the man. short term pain for long term gain"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "T O P E R",
      "comments": [
        "the switch will probably get lowered"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Theatre",
      "comments": [
        "But it’s not based on the tariff rates. They based it on the trade deficit. So the only way to get rid of the tariff is to start importing more than exports from USA"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Throughlput",
      "comments": [
        "“the tariffs are just retaliatory, they’ll go away when other countries appeal their rariffs bro trust me”"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "TremblingTarantula",
      "comments": [
        "They didn’t do some insane math they literally just did the ratio of the imports by the trade deficit 💔",
        "Also, we can “win” by getting foreign countries to lower their tariff rates, by literally just negotiating free trade deals. Thats what we did with Mexico. And Canada. And the EU",
        "Creating manufacturing plants in the us takes YEARS. That’s an endeavor which takes decades at most, and is way too complicated than just increasing the prices of goods for the consumer"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tyler wall",
      "comments": [
        "You also have to think how this will eventually make the US spend less money than it brings in for the first time in a long time."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Yoshi",
      "comments": [
        "so I can't buy made in China goods for 10$ now i have to support America workers and business and pay 20$ dammit.... how unfair"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Zac",
      "comments": [
        "You're damn right about \"magic math\" because he pulled those numbers out of thin air 💀"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "a sealed fire",
      "comments": [
        "literally the only nuanced perspective I’ve heard that talks about pros and cons."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "drummer dani",
      "comments": [
        "all these economic experts on tiktok comments after watching 2 \"im am right\" videos on tiktok"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "h",
      "comments": [
        "short term pain long term gain 💪"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "jakesnake7.62",
      "comments": [
        "Simple history lesson shows tariffs work and no tariffs didn’t crash the market or cause the depression the depression was in 1929 tariffs started in the 30s after the during the depression it actuall"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "jaxy",
      "comments": [
        "The tariff rates are not at all accurate, used in the measurement of the tariff rate for Foreign countries was our trading deficit, which is not at all related to tariffs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "kunalvohra37",
      "comments": [
        "Damm bro you’re saucy"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "kwb84",
      "comments": [
        "you mean pharmaceuticals steel aluminum and timber"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "lightskin",
      "comments": [
        "its not average tariff its trade deficit"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "mysterytard",
      "comments": [
        "Bro I don’t want to find jobs in Ohio, Kentucky, Mississippi now that if they’re gonna build these plants"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "reign",
      "comments": [
        "same logic applies, use American materials cause we are loaded on it"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "steelcurtain29",
      "comments": [
        "The unbiased way to look at tariffs is to say they will hurt in the short term and will help in the long term"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "stone",
      "comments": [
        "I think you misunderstood the math. The math is the trade deficit as a percentage of imports. it's NOT the tarrifs that other countries put on us."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "the_baconator🍻",
      "comments": [
        "ive actually been noticing that prices have gone down"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "tyhasnoenemies",
      "comments": [
        "fair enough but i mean if we are supposed to be the world police lets world police, but sadly it’s unrealistic because the rich benefit from people suffering and every country is ran by billionaires or just dictators"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user1361284874307",
      "comments": [
        "It will be wonderful for those who can survive starvation due to the price increase on food."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user9878192578142",
      "comments": [
        "Dems aren’t going to win in 2028 unless they drastically change something. Vance or whichever republican wins will just continue the tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "yoyocook",
      "comments": [
        "none of these companies tariffs are actually that high. that's the trade deficit numbers. combined tariff percentages are in the single digits"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "𝔭𝔞𝔶𝔫𝔢",
      "comments": [
        "when manufacturing and businesses come to us that will create jobs, tax paying businesses, it’s just not fair usa gets taxed 11% for cars in uk when"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "🇺🇳🌐OMICRON🌐🇺🇳",
      "comments": [
        "sometimes theres always pros and cons in everything"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "🏀",
      "comments": [
        "going large scale factory plants in the US would never work, the only reason China is able to do it is because they pay there workers close to nothing"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "💎💧Nathan_crf250r💎💧",
      "comments": [
        "ur missing a lot like car,boat,oil,metal,and is helping people like my dad already more work from gm ,dodge ,American Axle, way more jobs not just for the biger companies more jobs for smaller busines"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "😶",
      "comments": [
        "Crasy how he said pay a kid in China to make them. 😭"
      ],
      "language": "English",
      "pure_emoji": false
    }
  ]
}