{
  "video_id": "7496494206131735854",
  "video_url": "https://www.tiktok.com/@briantylercohen/video/7496494206131735854",
  "publish_date": null,
  "comment_groups": [
    {
      "user": "CokeMacLeod ofthe Mingos",
      "comments": [
        "NOTICE TO PURSUE CIVIL AND CRIMINAL ACTIONS NOTICE TO PRINCIPAL. NOTICE TO AGENT. NOTICE TO AGENT. NOTICE TO PRINCIPAL. DATE: January 22, 2025 TO THE HONORABLE COURT AND DEFENDANTS This document serves as a formal legal notice demanding immediate compliance, or Plaintiffs will seek the full weight of civil and criminal legal recourse. The Plaintiffs demand that the defendants cease these unlawful activities and take corrective measures to remedy the irreversible damage caused by thei"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "CraftMaster78",
      "comments": [
        "😢😢😢"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Delta Sierra Hotel",
      "comments": [
        "Trump is a prank from Russia, prove me wrong."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ella",
      "comments": [
        "Wow, it's crazy how they're fighting back against these unlawful tariffs. Trump's actions are really being put to the test now."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Eric",
      "comments": [
        "How many have you won?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "FRANKIE HERNANDEZ",
      "comments": [
        "Next President"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "James Seaforth",
      "comments": [
        "Dictatorship has no place in a democratic country. These are landmark cases to test democracy. A lithmus test if Congress and Judiciary is still existing or are they just lameduck in trump admin.🤔"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "KalessinDB",
      "comments": [
        "\"If they're going to be consistent...\" let me stop you right there, Governor."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "MrFKNS 🆘🇺🇸♿🪖🇫🇷🇮🇪",
      "comments": [
        "okay but the person in charge of the DOJ is a Trump stooge and nobody seems to have an answer to the question, who is going to enforce these rulings?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Silky the Clownfish",
      "comments": [
        "America is getting an Econ 101 lesson in how tariffs are a Trojan horse regressive tax on the poor so Trump can cut taxes for corporations and the wealthy. He’s Robin Hood in reverse. 🙄"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "matt harris",
      "comments": [
        "Biggest Political Loser in the world… I live in CA this man is a fool"
      ],
      "language": "English",
      "pure_emoji": false
    }
  ]
}