{
  "video_id": "7434259726768016683",
  "video_url": "https://www.tiktok.com/@derekpolasek/video/7434259726768016683",
  "publish_date": null,
  "comment_groups": [
    {
      "user": "!",
      "comments": [
        "By us made products. Quit selling our country!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "#ecd2ab",
      "comments": [
        "We could simply forgo the minimum wage and pay workers Malaysian rates to compete with Malaysian textile imorts, so on and so on."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "$t3v¡3",
      "comments": [
        "Do Americans have to pay the tariffs?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": ".—._. 🪳",
      "comments": [
        "I think putting tariffs on specific products is more effective than universal Tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "0rgan1z3d_k_os",
      "comments": [
        "just by American made products... what a thought. they're not all bad. they could hike prices at 1st but it will help if it continues. so we KNOW what we voted for."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "1-10 Ben",
      "comments": [
        "“Inported” 😂"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "1231g44",
      "comments": [
        "😁😁😁"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "16*29",
      "comments": [
        "dude, no. there are some things the US does not have the means to make. it won’t create all these magical jobs like everyone is thinking."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "A Hamster",
      "comments": [
        "Theres already an auto industry in this country. We do not possess the capability to create everything here."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "AHHHHHH",
      "comments": [
        "Blanket tariffs will be devastating for consumers. And manufacturers won’t move to the US, they’ll just move to another country that has a lower tariff rate than China. The consumer doesn’t win."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "ASTRO_Boy",
      "comments": [
        "even tesla build their factory in China. Their market in china is bigger than in US. So what's the point in making cars in US? that's the advantage of china. Bigger market."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Abel_la_Abel",
      "comments": [
        "What does this mean for needs like gas and food?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Adam",
      "comments": [
        "Exactly. Comparative advantages"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Addie",
      "comments": [
        "Many of chinas facilities use slave labor. Horrible."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ahjoo",
      "comments": [
        "Broad scope tariffs proposed by trump are bad for the economy- end of story"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Alex Ong",
      "comments": [
        "The US no longer produces many things such as accessories, parts and household goods. Even simple things like needles in hospitals and screws in cars are all imported."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Andi",
      "comments": [
        "I live in a small town in Comifornia and I think of the United States as a small place on the Earth and shopping locally cost more😏"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Andrew machinist",
      "comments": [
        "you forgot to mention about what if other country puts tariffs on imported US products 🤔 Remember what happened to US soy farmers in 2019? Tariffs are bad."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Andrew227",
      "comments": [
        "What the point of putting a tariff on fruit? There isn’t one."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Angel",
      "comments": [
        "Low key annoyed they didn’t say anything until after it was over and still yell. But at least with this guy if it doesn’t work, he won’t wait until election year to fix the mistake"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Anita",
      "comments": [
        "I want to stop relying on other countries. it makes us weak. we knew what we signed up for when we voted - short term pain for a long term gain."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ashley Marie Leach",
      "comments": [
        "I find it funny how the entire United States has become experts on tariffs in 6 months….."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "B",
      "comments": [
        "He never advocated a flat tariff on all goods coming in…It’s country by country on a reciprocal basis on how the tax our exports…"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "B K",
      "comments": [
        "Products produced here are more ethical."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "BD Fudge",
      "comments": [
        "What about products that we don’t produce or goods that we can’t produce (vegetables and fruit)?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Babushka",
      "comments": [
        "If there are more jobs, no income tax. Wouldn’t that offset the price of goods?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Backi8787",
      "comments": [
        "We have to put our faith in Trump and I'm all for it"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Bailey Mae",
      "comments": [
        "People will complain about the slave labour in different countries and not buy from those companies. I think this they would support because the USA would no longer support that slave labour for products."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Banananariel",
      "comments": [
        "He wants to replace federal income tax with tariffs. Can you make a video of this?",
        "So they haven’t figured out a solution where we can have both!!!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Basilio",
      "comments": [
        "🔥🔥🔥"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Bayglen guy",
      "comments": [
        "A lot of you think the tariff will pass to consumers. During China trade war 2018-2020 a substantial portion (75%) of the tariffs on Chinese goods were absorbed by U.S. importers and businesses."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Beef🇩🇴",
      "comments": [
        "Automotive industry most likely"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "BekahN",
      "comments": [
        "It will take over two decades to create the infrastructure and grow the resources we need to create everything in the US, not even looking at the increased cost of labor."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "BernedoodleJasper",
      "comments": [
        "Which car will you CHOSE to buy. The very expensive tariffed import, or the less expensive American car. You will buy American. YOU chose which one to buy. You’ll still be able to buy a car."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Beth Chiasson",
      "comments": [
        "♥️♥️♥️"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Bill Kruzan",
      "comments": [
        "If we put Tariffs on thing we already produce and counter inflation with deregulations of the energy sector we’ll be sitting pretty good"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Bloop. 🙃",
      "comments": [
        "De regulation is a huge part of his plan… why is no one mentioning this?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Boushay",
      "comments": [
        "Trump Did 150+ tarrifs in his first term and there was no Inflation"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Brady",
      "comments": [
        "this is the best way I've found to explain it. I understand how inflation will happen and it will be bad but it will also give more jobs for Americans. We kind of have to see how it goes to kno"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Braiton",
      "comments": [
        "Thank you for the unbiased take! I like hearing both sides of an argument and this was very helpful"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Brandon",
      "comments": [
        "According to people on the right. 1. Things are too expensive. And 2. People don’t want to work anymore. So supporting tariffs seems pointless for them."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Brian",
      "comments": [
        "easiest thing to do would be to not put tariffs on raw materials/ base materials like steel and aluminum vs end components (shoes, clothing)"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Brook †",
      "comments": [
        "And also you can buy American it will not be expensive, like 97% of our food is made in the USA. Other then like highly processed food, tariffs didn’t affect us in 2017 it wont affect us now, companies have already started moving businesses back to the USA bc they know they are being tarrifed : General Electric, intel, Nike, whirlpool."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "BrotherHezakia",
      "comments": [
        "Well most are slave labor and that’s hard to compete with"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Bryce",
      "comments": [
        "Everything is about to spike up, and trumpers will blame amount but trump for this 😂"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Bryce Romick",
      "comments": [
        "if you have more american jobs you get lower unemployment with brings higher wages. plus with lower taxes on top of that it will cancel out the inflation."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "BubblesEsser",
      "comments": [
        "Reshore, create jobs, save tarriff. Fire the economy. Just look at Toyota and that success"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Buttonwood24",
      "comments": [
        "What about reciprocal tariffs hurting US companies. Also, us has a labor shortage"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "CAVE DIVER",
      "comments": [
        "I'm gonna out on a limb here and say that most Americans didn't want to see price increases in 2025..."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Carl N357",
      "comments": [
        "no it helps me",
        "add in getting rid of income tax...thats huge."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Carla",
      "comments": [
        "Does America have all the MATERIALS to make said cars here?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Carly",
      "comments": [
        "Are you accounting for automation? Genuinely curious. Labor costs are prohibitive here - why would companies not just automate vs. hiring?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Carol saldarriaga",
      "comments": [
        "I think it eventually makes the business going use extra more can bring more goods or use for repairs of equipment."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Casserole",
      "comments": [
        "💕"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "CatchEmAll PokeClub",
      "comments": [
        "No tax means more money in your paycheck. Tariff means more American jobs. You can pay for the raised prices with your higher paycheck… or just buy the cheaper stuff made in the us."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "CatsnBikes",
      "comments": [
        "Better quality if made in the USA!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Charles",
      "comments": [
        "There already is one"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Charlie",
      "comments": [
        "Would more American jobs make or not make products cheaper here though?",
        "Are you deleting comments?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Chelsea",
      "comments": [
        "It’s a tad stressful as a small business owner. There are no American factories producing what I design/sell."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Chris Harreld",
      "comments": [
        "All I know is that Foxconn put nets around their building to prevent people from jumping off the building, I’m assuming because their work environment isn’t the greatest."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "ChrisCouch__",
      "comments": [
        "Tariffs are a leverage tool. Once those factories are established in America, we could see an increase of jobs without the increase of cost. It will just take a little time. It’s an investment"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Christoforo B",
      "comments": [
        "So this is wrong"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Chuck",
      "comments": [
        "all plants that can't naturally grow in the usa are gone permanently"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Chucks Uwaje",
      "comments": [
        "What would be the benefit in putting facilities here? They’re still going to need to important natural resources from other country tries that will have a tariff laced on them add that we still have to pay our workers competitive wages. In order to supplement these they’re gonna have to raise costs am I wrong?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Clarance Marques",
      "comments": [
        "😂"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Clayton Andrew Gonte",
      "comments": [
        "You either love America or you don’t lol",
        "No man I’m saying if your for tariffs you love America if you don’t want tariffs and want to paying cheap junk and be taken advantage of then you hate America aka liberals",
        "That’s ok man but I think the tariffs are a great idea. We have been bullied for a long time. It’s time we get things back on track"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Clickclock11",
      "comments": [
        "Why not be honest? We don't need more jobs. Unemployment is incredibly low. We need to avoid more inflation. Trump's tariffs are not good for us right now"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Clint Russell708",
      "comments": [
        "Won't be any worse than hiking business tax to 45 %"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Collin",
      "comments": [
        "we already the most competitive country in the world"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Cory",
      "comments": [
        "Unfortunately this is no longer 1945-1980 America where products assembled in the U.S. used components sourced from U.S. manufacturers. Many components will still be sourced from foreign manufacturers"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Courtney Rooney556",
      "comments": [
        "Yes…but trumps broad 200% tariff will not work!!!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Crunchwrap Supreme",
      "comments": [
        "We’re cooked"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Curtis",
      "comments": [
        "It’s called reciprocal that’s all Trump is trying to do"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dan Gartman",
      "comments": [
        "Tariffs Need to be implemented in a strategic manner. The tariffs on Chinese electric cars probably makes sense. Blanket tariffs on entire countries would be a catastrophic policy choice."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dancing queen 123",
      "comments": [
        "nobody talks about if a foreign country controls a product, pharmaceutical companies are out sourceed to China. our medications are out sourced"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Danielle Michelle370",
      "comments": [
        "I think it’s funny that now everyone has an issue with tariffs when every single administration has done this. But now it’s suddenly a bad thing."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Danny555557🦆",
      "comments": [
        "I want more jobs available in the USA"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "David",
      "comments": [
        "takes years to get it working for us"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "David Astle",
      "comments": [
        "I choose if I buy a product with a tariff or not. More people will start buying domestic produced goods."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "David Krouse",
      "comments": [
        "More tariffs=more American jobs=More money in our economy= higher economy=more money for everyone as US economy builds upon itself"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "David Meiser801",
      "comments": [
        "Most electronic consumer goods are imported and those manufacturers have zero plans to build manufacturing in the US so expect higher prices"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Davin Wadsworth",
      "comments": [
        "Short term Left, Long term Right"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dawn BELL",
      "comments": [
        "🥰🥰🥰"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Dayson",
      "comments": [
        "One of my biggest reasons is it’s punishing child labor"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "DaytraderFL",
      "comments": [
        "No It does, car manufacturers will build in mexico due to NAFTA and still compete with American automakers. The 10k car is now costs 12k and selling 20k (profit 8k), either way, consumers lost."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Deanna",
      "comments": [
        "Thank you for your explanation on this ☺️I appreciate it because I was confused"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Derek Polasek · 创作者",
      "comments": [
        "I’d say I’m close to you. Probably slightly center left, although I lean right on a lot of things. Trump ≠ traditional Republicans, that’s why the love for tariffs all of a sudden.",
        "No problem! 👍",
        "Yes you can. Although it’s more difficult and they are usually not called tariffs. More so “fines” or “penalties” regulatory barriers.",
        "👍",
        "Importing companies in the country imposing the tariff, pay, yes that’s correct.",
        "Absolutely",
        "Let’s",
        "America stealing Chinese tech is a hilarious take",
        "How",
        "I 100% agree.",
        "In a sense, yes. In a capitalist economy, the idea is to maximize profit. Unfortunately consumers are also employees, which means there is a constant battle to lower wages AND raise prices as that",
        "You mean me personally? Lol",
        "Unfortunately, I disagree wholeheartedly.",
        "Did you even watch the video dawg?",
        "I agree. I have a much more in depth video on YouTube. TikTok is too short form to cover everything.",
        "Perhaps I didn’t make my stance clear enough on this video. I have a much more in depth video on YouTube. My stance is against blanket tariffs just so you’re aware.",
        "That’s ur opinion. I don’t think it’s incorrect. Tariffs, usually targeted, can be beneficial. Blanket tariffs, like we saw with Smoot Hawley, usually horrible. I apologize if I didn’t make that clear",
        "Absolutely not. Never have never will. If a comment doesn’t show up it’s because TikTok flagged it. I try to unflag as many as possible but sometimes it’s impossible because some genius app designer",
        "In this case, probably. I meant it more, so, as tariffs in general. But yes, blanket tariffs are usually a bad idea and don’t really lead to positive outcomes. Unless, there are a negotiating tactic",
        "I don’t disagree with the first part. I think it’s a bad economic plan. I don’t think people voted on hatred though honestly. More so a misconception that the president directly controls the economy.",
        "Look at WWII. It would take effort, but we can turn into a manufacturing powerhouse if and when needed.",
        "Huh",
        "What is not inflation?",
        "Trump is proposing a blanket tariff though."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Devin",
      "comments": [
        "I'd buy a 20k electric car though",
        "the right still sounds more bad"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dewey not Huey",
      "comments": [
        "US Senate history webpage calls the Republican's 1930 Smoot-Hawley Tariff (20%) \"among the most catastrophic acts in congressional history.\""
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dilligaf.",
      "comments": [
        "THATS NOT INFLATION!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dimitar",
      "comments": [
        "You’re missing a key point my friend, American companies jacking up prices because of no competition because why not? That’s their goal, to make money, tariffs are bad unless they are surgical."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dingee",
      "comments": [
        "Millwright here. American industry is dying and without it so does our country. West rock charelston, sc. evergreen canton nc, international paper georgetown, sc. ALL CLOSED UNDER BIDEN"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "DiscoverTheCarolinas",
      "comments": [
        "Accept unemployment is really low right now so those imaginary jobs arent needed really"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dixon_Yass",
      "comments": [
        "Sooo democrats still want slavery?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dodskriger",
      "comments": [
        "Lol more jobs less workers. Tariffs can't compensate the loss of income tax. The deficit will sky rocket. They want to crash the economy so they can buy up assets cheap"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dr.min400",
      "comments": [
        "Trump is also trying to balance it by getting rid of the payroll tax"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Dutchman74",
      "comments": [
        "Im here for higher prices and American labor to benefit"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Düstïñ",
      "comments": [
        "we gotta have teriffs. it's about time they start paying us. we make all these other countries filthy rich."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Eaj",
      "comments": [
        "Cars are still fuckin expensive lol 😂"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Eddie",
      "comments": [
        "Tariffs eliminate the Income Tax. Brings manufacturing to America. A win-win for foreign companies and our economy."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Eddie Waitkus",
      "comments": [
        "Inflation never raised his 4 years?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Edenwill2000",
      "comments": [
        "Can tell you’re already biased."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Edwin Byrne",
      "comments": [
        NaN
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "ElJose958",
      "comments": [
        "yea, you can build a car, but where the materials come for, also talk about the food, but exemple, avocados, lemons, bananas."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Eli",
      "comments": [
        "It also depends on how much federal income tax is reduced. Trump has suggested elimination of income tax. That would make the increase of certain goods negligible for individual wealth"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Em",
      "comments": [
        "well that American made ev has diodes and fuses and parts that will be tariffed. it's not just finished goods."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Esmeri",
      "comments": [
        "The idiot makes all his goods in China"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Estella",
      "comments": [
        "Blanket tariffs are bad. Retaliation tariffs are bad. Deporting a significant amount of the labor force is bad...socially and economically."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Eva Puriy",
      "comments": [
        NaN
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "FV",
      "comments": [
        "Sir… if the car is made here and gets 25% more expensive, the company hires more people (at minimum wage), yet, that person with a job will never be able to purchase the more expensive car."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Felipe Miranda",
      "comments": [
        NaN
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "FeralRedhead",
      "comments": [
        "he also said no more income tax... so you'll be able to absorb the tariff cost. people need to let the businessman work. he's not out to hurt you."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Filly Lilly !!!!!",
      "comments": [
        "Nope your wrong either way you described it will be more expensive ,you even explained why it’s more expensive to make goods in the US"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Financial education",
      "comments": [
        "Problem is we don't have everything we need to manufacture here and those winter be jobs they will be automated"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Flamefox20",
      "comments": [
        "But the problem is, that people think they will lower the cost of good AND create more jobs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Fox23racing",
      "comments": [
        "It’s a reset that we need"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "FragileCanadian",
      "comments": [
        "hypothetically, if mattel decided to build a factory here to build their product, wouldn’t they need to import materials to build said product, counter acting the desired outcome?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Fuwzy🌺",
      "comments": [
        "it’s 10% not 25%. That is misinformation to start. Second tariffs have been around for centuries and are on and off. The way trumps plan is set up makes it no cause inflation."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "GILBERT galan",
      "comments": [
        "This is a good explanation. The only thing you left up is if the tariff bring down the demand then eventually the manufacture made eat some of that cost."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Gabe.Writes",
      "comments": [
        "Who’s gonna work these jobs? Is the other most important question"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Germasian",
      "comments": [
        "It only works if the items already produced in US and have a substantial market share. If an item need infrastructure 1st to produce, then it is a NO. So across the board is bad.",
        "It will cost a lot more for stuff that is not made here normally. lumber: we don't have enough mill at this moment to cover all needs. take years to build mills and train labor.",
        "means, next 3 years....lumber will cost 20% more but this will affect so many things... insurance, housing.... not just lumber...everything will go up"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "GetEm84",
      "comments": [
        "if importers here pay tariffs to US Govt where does that money go????"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Glitter balls",
      "comments": [
        "This was over simplification. And you also missed a very important area of retaliatory tariffs. However, if you asked the very simple question of jobs or lower prices, the voting would have been very very different.",
        "Btw this isn't an economic answer. It's just too simplified and makes out it's 50 50, when in fact one will badly damage the economy. As detailed by actual economists.",
        "Ok, but this snippet is overall incorrect. it says trump tariffs, which lets face it we know will be bad, and likely won't produce all the jobs and manufacturing in America. If you said blanket tariffs, that might be a bit different."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Goat_lifts 22",
      "comments": [
        "😁😁😁"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Haidar Al-Darbass",
      "comments": [
        "Yes"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Hayden_itzenheiser",
      "comments": [
        "It depends, trump is going to place them on certain items, nkt everything",
        "He has said multiple things, we will have to see what he actually does",
        "Ha, no, tariffs can be used properly in many situations, you guys are wild, Kamala didnt even give an answer on her economic Policy, and the few things she said, wouldn’t ever pass. So thanks"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Howudoing?",
      "comments": [
        "So how long would it take to build and start said factories and could the American public withstand the wait?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "I.am.Gojo_Satoru",
      "comments": [
        "So we’re screwed , got it"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Insert Original Name",
      "comments": [
        "tariffs are bad for immediate price increases. however if they company does build there shit here. not only does it boost the economy here. but it will also cause lower prices over time."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Into The Grey Zone",
      "comments": [
        "What else besides cars usa produces that tariffs are benefitial ? Nothing …"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "It’s Mary B.",
      "comments": [
        "What about products that are not imported and also have increased in price? I think America should be capable of producing their product own goods. It’s a win win in my opinion."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "J",
      "comments": [
        "You know it’s not like things are great now with all supposedly the cheap immigrant labor, and no blanket tariffs…. Shouldn’t things be great?",
        "I’m curious. What do you think of Scott Bessent and how he’s Trump economic advisor? He’s said to be appointed as treasurer."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "JDominguez",
      "comments": [
        "More jobs, better quality, and more independence from foreign powers"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "JRR MLT",
      "comments": [
        "But its not a fast as like one month they can build facilities in US, its will take time and they will get funding by increasing the production prices thats affects the consumers."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jack Dahler",
      "comments": [
        "I don’t think there are many benefits. It takes an extremely long time for manufacturing to catch up, and Americans will only experience high prices during that time. Not to mention trade wars"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jacki the momtographer",
      "comments": [
        "Why weren’t the items more expensive last time though?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jacob",
      "comments": [
        "So basically we go left we basically have no jobs and no money to buy the cheap s*** we go right everything goes up a tadbit but we're all making bank and getting paid lots of money and we all got a job and we can buy everything we want I think I'll go right"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jacob Harris",
      "comments": [
        "So yall just ok with slave labor then?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jacqueline",
      "comments": [
        "higher priced goods don't matter as much if we get to keep more of our hard earned money. there's a balance."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "JaidavariusIII",
      "comments": [
        "People are forgetting Trump offset the higher prices of goods with other economic policies such as tax cuts, and energy policies which made transporting goods within the country. Which is why stuff was cheaper than it is now even with his tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jake",
      "comments": [
        "just look at what grover cleveland did with tarrifs. he used tarrifs instead of taxes to fund the government and it was really good for the economy"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "James K",
      "comments": [
        "You can also look at it like this. The rich who consume more of imported goods will pay/contribute more while, normal people will still net through tax savings"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jason",
      "comments": [
        "Even if it incentivizes companies to build here and create more jobs things are still gonna be more expensive which in turn increases inflation"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jason Sponseller",
      "comments": [
        "🤡🤡🤡"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Jay",
      "comments": [
        "No one wants to buy American goods bc they are trash… foreign goods are better quality. Just look at Japanese made cars."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jeff Jones",
      "comments": [
        "Trump put a 25% tariff on China, why didn't Biden remove it?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "JenAustin82",
      "comments": [
        "You should be buying American products stop supporting countries that don’t support America. Also would move companies back in America which would make more jobs for Americans."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jeremy Piper",
      "comments": [
        "I believe everything we bc ok people just be to relax"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jess",
      "comments": [
        "Companies have already stated they will just raise prices, manufacturing plants take time. Tariffs hit the lower/middle class much harder. Billionaires will essentially pay no taxes now in comparison.",
        "We will most likely pay the tariffs. Companies buy product (now taxed 20% more) then they will sell to us for at least 20% more"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jimmy",
      "comments": [
        "basically tells me that liberals support slave labor and Chinese child labor/sweat shops"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jmm",
      "comments": [
        "Manufacturing jobs generally don't pay very well, even with our labor laws..."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Joel Bryant",
      "comments": [
        "I wouldn’t say I’m for a long-term tariffs, but I’m definitely for short term use , being used as a way of leverage"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Joel yezeh",
      "comments": [
        "So what about a blanket tariff ? How many new companies will be created to match US demand ?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Joey Picon",
      "comments": [
        "So everyone who cried about prices being to high lied, what they really wanted is to have more jobs here and higher prices"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "John",
      "comments": [
        "😳😳😳"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "John Burke",
      "comments": [
        "…second they will put counter tariff to USA, in results USA will be more isolated",
        "This analysis is wrong! If the car companies in USA could not make it cheaper in USA, how other companies outside will make the car cheaper in USA. First they will shift to other developing markets,"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "John India",
      "comments": [
        "Unemployment is low, inflation was the biggest concern for American voters. The left’s policy would better address the average Americans concern, while Trump’s tariffs will exasperate them."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "John Jacob jinglehimer",
      "comments": [
        "Tarrifs if applied reasonably are like chemotherapy"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "John Stringfellow",
      "comments": [
        "Heres the problem - he campaigned on reducing food prices. That aint gonna happen with tarriffs. Its a no brainer fact."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jordan Quandahl",
      "comments": [
        "What if we want lower prices and more jobs? Then what?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jose Martinez",
      "comments": [
        "umm all the car and other companies will still have to buy raw product from other countries."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Josh Snow",
      "comments": [
        "No. What happens when tariffs are implemented is the product will get exported to another country without tariffs or less tariffs, and then imported here from that country. We won’t start producing",
        "You remember what happened the last time a blanket tariff was implemented? I’ll give you a hint, the blanket tariff was implemented in 1930, and FDR had a big mess to clean up very soon afterwards"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Juggs",
      "comments": [
        "It’s the best way to leverage against China. We have to be willing to use them or China has more power in negotiations. It’s a negotiating tactic."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Julz",
      "comments": [
        "Buy American 🇺🇸"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Jumpman23",
      "comments": [
        "😂"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "JusAki",
      "comments": [
        "the problem is not tariffs in general, for example biden kept many trump tariffs. But the problem comes when a flat tariff is put on EVERYTHING. the US cannot produce everything"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Just another Chad",
      "comments": [
        "Everything is economics is a trade off - there is no pure good or bad. The question is: will tarrifs solve the current issues with the US economy?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Justin",
      "comments": [
        "tariffs have been a cause of every recession in America"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Justin Davis",
      "comments": [
        "Do people not understand business? I negotiate with china all the time. I force them to pay the tariffs during our business deals. Or pay half 😂😂😂 I can’t with people."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Justin Kettner",
      "comments": [
        "Will it affect us right away so ppl realize were boned"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "KWALL",
      "comments": [
        "Can't they use a bonded warehouse to side-step a tariff?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "KatlasZapp",
      "comments": [
        "Many of trumps tariffs are in place to this day. Clearly they can’t be that bad. We just caught a rocket like a baseball and you’re telling me we can’t produce cars, materials here?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kc1000",
      "comments": [
        NaN
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Keekee",
      "comments": [
        "Most of us on the left see tariffs across the board, and tariff hikes as bad, not just any tariff. A tariff, makes sense as a competitive advantage when it’s appropriate to the demand of a good"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kevin Alsip",
      "comments": [
        "We need more American jobs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kevin Perez",
      "comments": [
        "Or we incentivize with less taxes on producing goods here. Negates the tariffs impact on the consumer. Companies wouldn’t have to transfer the costs because they would pay less taxes."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Khalil Maher",
      "comments": [
        "take Nike shoes made in China for $1 and still wold here for $200 the jordans.if America cared for American employees it should put back senior citizens into tolls/turnpike and remove kiosks in stores"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Killvy",
      "comments": [
        "It creates a free market in the US.",
        "Getting rid of taxes and making the government leaner means you have more money for the more expensive products, the leaner the government gets and the less tax you pay the more tariffs make sense"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kim ☀️🏔️🍃",
      "comments": [
        "It does not."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kimia",
      "comments": [
        "Applying to tariffs to all goods is the stupidest idea. America can’t compete in every industry. We’re literally not resourceful in all goods and we have MUCH higher wage costs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kirk N Jerk",
      "comments": [
        "I'm hoping he only does it for certain things that we can make easily if supply stopped"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kisha Rodriguez",
      "comments": [
        "But it’s going to move the prices up because we pay higher for jobs and Labor."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kobe4Life",
      "comments": [
        "US Companies importing the goods are the ones paying the tariffs though. Not the company that exports the goods into US. So in the end, consumers are the ones paying for the tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kody Eutsler",
      "comments": [
        "The China tariffs from trumps first presidency are still in place, Biden realized they were a good idea and left them alone. Not much will change to be honest"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Krasko",
      "comments": [
        "If you want cheap you gotta use slave labor and child labor"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "KrysT",
      "comments": [
        "more american jobs okay but the unemployment is already very low and the us can't compete with the availability of low skilled labor from countries like china or vietnam. but it could with immigrants.",
        "immigrants that are no longer welcomed so more factories less low skill labor more expensive stuff for not that much more high paying job nor low income taxes cuts? i root for cheaper stuff sorry"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kyle Losik🇺🇸",
      "comments": [
        "I hate that we moved to foreign production of product"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kyle Ramos",
      "comments": [
        "You should also explain that if companies do not follow through with producing in the US, it opens the market for American entrepreneurs to start business, create jobs and keep cash flow in the USA"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Kyle “Easy Pickens",
      "comments": [
        "Can Donald Trump actually help us re achieve energy independence?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "LAB19325",
      "comments": [
        "We are currently living the consequences of tariffs and bad oil deals."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "LOONEY CUUNS",
      "comments": [
        "That depends on the supply of workers. Most ppl are having hard times finding jobs so companies take note and will pay you less than what you’re worth, plus an increase in PC means they scale back on"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "LaZ",
      "comments": [
        "We’ve been running short term strategy for so long a long term strategy is gonna feel like being on fire. We have to pan out & realize there is a global war for economic advantage & we’re competing1/2"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "LandalfTheGreat",
      "comments": [
        "Longer term Right. Short term left. It's likr working out. It sucks at first but as you do it longer it gets easier and you reap the benefitd"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Lannn",
      "comments": [
        "No no no, in the right you’re gonna hear we dont give a fck what the left thinks anymore. 12 years of lies and lawfair, they lost all credibility and respect."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Leah🍋",
      "comments": [
        "🥰🥰🥰"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Likegod butbetterloo",
      "comments": [
        "So they aren't both right. The left are right blank tarrifs are bad and do nothing of value. Targeted tarrif particularly on emergent industries are good to help the US grow a strong base in that..."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Lilithateadam",
      "comments": [
        "as long as it's not a tesla lol"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Lisa Raby",
      "comments": [
        "Most raw goods are imported so the companies being here doesn't entirely solve the issue."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Little Deer",
      "comments": [
        "so would wages go up in companies to match the tariffs rise and product cost?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Liyahxo",
      "comments": [
        "Who CARES if it’s produced in the US if we can’t fucking afford it. MAKE IT MAKE SENSE."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "LongMuffin",
      "comments": [
        "Targetted tariffs aren’t bad in of themselves, universal tariffs are a terrible idea"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Lori Coley",
      "comments": [
        "TRUMP WON BY A LANDSLIDE!! Kamala didn’t even get close!! PRAISE JESUS!!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Lovinglife124",
      "comments": [
        "Wouldn’t production need to go up? Will it not be fast enough causing the inflation to only be temporary? The market will correct itself either way more jobs here? Do I get it?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mactan Island Construction",
      "comments": [
        "wow atleast you explain both side."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Maddytalk615",
      "comments": [
        "Made in America is gone"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Magdog",
      "comments": [
        "when Apple would Produce in the US, they could sell IT for the Same price. But they would Not get so much of a win. The Problem is the that the are so greedy. so the would Only eaen 500 Dollars insted of 1000😅"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mala B",
      "comments": [
        "It will take more than a decade before the economy and the US consumer to reap any “benefits” of domestic manufacturing. Regardless, U.S companies will still have to import raw materials.",
        "The economy isn’t a vacuum. There will be other countries that go into a trade war with us. There will be retaliation. Tariffs realistically will do more harm than good. Short and long term."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Marcus Renard",
      "comments": [
        "This has already been done and it was very successful"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Martin",
      "comments": [
        "It would take decades to be self sufficient in the US, if even possible. Most tech items require components not able to the sourced in the US & would need to be imported to complete manufacturing.",
        "No what that means for EVs having 100% tariffs on imports equals a huge benefit to Musk and Tesla. 🤔"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Matt michael",
      "comments": [
        "Remember everyone, the Biden administration kept the tariffs that trump imposed on his first election. So I guess tariffs aren’t all that bad."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Maureen",
      "comments": [
        "No not left and right. Economists, historians, tax attorneys and pros vs trust me bro YouTubers"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Max",
      "comments": [
        "What’s alarming is the increase in “what’s a tariff” being googled AFTER the election like guys cmon if you’re gonna vote for him atleast look it up before"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "MayLee Tan",
      "comments": [
        "it is not about protecting American industries but about taxing more to finance wars"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "MegaCreditRepair",
      "comments": [
        "It’s not only the labor, it’s the raw materials too",
        "Even if you get them here to manufacture goods the cost will be way greater than if paid 100% tariffs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mel K73",
      "comments": [
        "This is unreal... As a Gen Xr,, I remember the reason manufacturing was moved to Mexico and Asia in the 90s was to boost profit margins for companies because of cheap labor and therefore better profit margins and ultimately higher value to shareholders - this is a terrible idea!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Melissa Smith4262",
      "comments": [
        "Where are we going to get all this American labor?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Michelle is sober 😁🥰 💪",
      "comments": [
        NaN
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "MichelleRN 🇺🇸",
      "comments": [
        "They put tariff on us"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "MikeHunt",
      "comments": [
        "We literally had tarriffs during trumps last administration"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mikev4",
      "comments": [
        "so what are Americans struggling with right now? unemployment or cost of living. if you look at the numbers is clear the problem is cost of living. so tariffs are not the answer!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Miles Lee",
      "comments": [
        "The problem is that the employment is at 4.2%, that’s a good number, so we don’t have a labor force big enough to manufacture all the things trump is putting tariffs on."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Milooch0",
      "comments": [
        "And America will steal, copy and imitate Chinese EV technology through Elon Musk because he has Tesla in Shanghai."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ming",
      "comments": [
        "We need to make more here. China poisons us ."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mitch G",
      "comments": [
        "I’m all for it when it comes down to stop exploiting South America and Asia cheap labor. Yet it comes down to comfort, creating more jobs with low wages with higher prices on goods is going to—"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mitchell Hess",
      "comments": [
        "What about things we can’t reasonably produce in the U.S.? We don’t have a favorable climate to grow tea leaves and import most lf it from China. For many crops, we’d be forced to pay the tariff."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Morgan Lewis",
      "comments": [
        "So the robots can work on things"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Morten1967",
      "comments": [
        "Its not the country who imports it,companies does so the country never payes the tarifa",
        "I know so the effect on the tarifs Will not be on the country but the companies and the consumers like it is in every country with tarifs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Morty Pompei",
      "comments": [
        "Yeah except he wants 10-20% tarrifs on everything. That’s not like putting tarrifs on electric cars. A blanket tariff on all imports is just madness"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mr.Matt",
      "comments": [
        "I think you forgot to address that last point. yes, tariffs might bring American jobs in but Americans cost more which means the product cost the same"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mungaya30",
      "comments": [
        "The problem here is that, the timing!!!! that needs a nation strategy not one person idea."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Munk",
      "comments": [
        "I don't see any companies scrambling to make their companies here 😂😂 they will find other countries where it's cheaper to make their products."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Mushkie",
      "comments": [
        "What would happen if minimum wage was universal…🤔"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "N8",
      "comments": [
        "Tariffs are dumb, im just surprised the economically illiterate left randomly realizes that just because its trump supporting them lol"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "NS678",
      "comments": [
        "*more jobs of certain types. Jobs that depend on import/export or jobs in US companies that rely on globally sourced materials may be lost and may even offset job gains in manufacturing."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "NewLifeRDTex",
      "comments": [
        "The Smoot Hawley in 1930 did not benefit our economy in the least. Look up what Ronald Reagan said about Tariffs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Nicholas Odom",
      "comments": [
        "Exactly"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Nicholas Russell620",
      "comments": [
        "food..milk..gas..house stuff..that's all we need..anything else is extra and u pay for extra"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "NickyBobby",
      "comments": [
        "that sounded like the Heath Ledger joker voice \"it's gonna be bad\" cool lol"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Nicolas Métivier",
      "comments": [
        "😁"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Nicole Y",
      "comments": [
        "🥰🥰🥰"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Nikki LaShay",
      "comments": [
        "Okay so the people who are in business get to build EV cars for other rich people and lower income workers miss out on electric vehicles altogether okay. We see who wins."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "NikoliDean",
      "comments": [
        "1. we ran on tarriffs instead of income tax prior to WW. 2. trumps tarrifs were in affect 16 to 20. 3. petrol dollar is about to expire. we need to manufacture here heavily before that happens."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "No",
      "comments": [
        "I think most companies will choose to pay the tariffs bc it would be cheaper than moving their whole manufacturing process to the US. W/ tariffs they can pass the cost to consumers by raising prices",
        "To the US govt just like any other tax, ultimately the consumer will pay it in the form of increased prices at the store"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "NotAnOriginalName",
      "comments": [
        "It really seems to be a balancing game of sorts. Not something to over do, but can have positives in moderation"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "NotAnglebertHumperdink",
      "comments": [
        "The ones cheering dont even know what they are"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "OmegaChaosZ",
      "comments": [
        "My company just entered into rapid acquisition talks from a eastern European company just so they can produce in America to avoid these tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "OutlawShiit",
      "comments": [
        "😂😂"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Ozai",
      "comments": [
        "On principle, it’s common sense for the any leader wanted their citizen to buy local…I mean if you have the capability to produce all those item, but in practical sense I’m not sure …ask American."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ozziel Garcia",
      "comments": [
        "😳😳😳"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Pablo Corvalan",
      "comments": [
        "🙏🙏🙏"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Pancakefutures",
      "comments": [
        "Never listen to a guy selling a course."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Papi",
      "comments": [
        "They will just sell there stuff somewhere else without paying that tariffs or having to buy a million dollar company in us"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Pastor@WellspringTabernacle",
      "comments": [
        "Toyota is a prime example of tariffs working correctly. The Toyota vehicles that are sold stateside are built in America."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Patrick",
      "comments": [
        "And if Harris were president, she was going to raise the taxes on the companies that sell those imported items which means those companies will pass that tax increase onto the consumer."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Pekatronix",
      "comments": [
        "if he said that he's going to get rid of tax on overtime and tax tips Americans will not suffer from higher priced goods🤷‍♂️"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "PerryLee",
      "comments": [
        "inflation is caused mainly by government spending. You cannot look a one program and claim it will cause inflation. Government spending will be going down and Americans will start buying US Products"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Pharmajen",
      "comments": [
        "We are an under educated, over paid workforce. That is an undesirable combination."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Phlegmralds",
      "comments": [
        "Bro, his imposed tariffs are horrible. Quit fence sitting. You can argue for nuanced tariffs, we’ve done that and it’s been ok. Trump’s tariffs are not nuanced, they’re ridiculous."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Poppyseed",
      "comments": [
        "Yes. Just look at the Great Depression the last time The Republicans brought in Tariffs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Preston",
      "comments": [
        "The problem is how are we going to mass manufacture things when we don’t have enough people to do these jobs if you ask most people would they rather work in a sweatshop shop for little money or a"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Prince_bennedict official",
      "comments": [
        "No more free trade that sponsored by The US at the first. 😂😂😂"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Q",
      "comments": [
        "So tariffs became a problem when trump wanted them. Got it"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Quadi",
      "comments": [
        "Majority of companies in America are not going to build factories in America because it’s too expensive so they’re just going to go to China still and we’re gonna have to bite the bullet"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Quinn O’Flynn 🍉",
      "comments": [
        "This is an excellent analysis… one thing to expound upon is the long period of time it takes American manufacturing to catch up and the possibility of trade wars."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "RayneScott",
      "comments": [
        "Trump is a business man, a very successful one. Our economy is just a big business, therefore I trust him to run it."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Redwulf",
      "comments": [
        "When you said \"Both are correct..\" I moved to the next video."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Reed Mcwire",
      "comments": [
        "Farmers will suffer from retaliatory tarrifs from China on our exports. We need a bail out signed as soon as president trump takes office."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "RicedEg",
      "comments": [
        "Essentially American companies will have a chance again. We won’t be getting out bid by foreign companies. Stop buying foreign products and support US companies, problem solved!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Rick_dogg",
      "comments": [
        "😳😳😳"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Riot",
      "comments": [
        "the US thrived on tariffs B4 the fed tax was imposed. fed tax was supposed to be temporary to only fund a war, but the govt got greedy. he's wanting to do away with tax & use tariffs only again"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Rob2Fresh4This",
      "comments": [
        "thank you for the information"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Robert Brooks",
      "comments": [
        "I agree that it CAN force companies to make products here. But why would they in this situation? And does the proposed tax break offset the tariffs?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Robert Heller",
      "comments": [
        "across the board tariffs are going to kill the wallets of average Americans, and for a long time. the time and labor required to bring that business over isn’t overnight if they choose to move"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Rolf Schwarz",
      "comments": [
        "But how much more expensive goods would be, how long it would take to develop manufacturing for all parts of said electric vehicles, and if all non-electriccars products would be made in the US"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Rommelx296x",
      "comments": [
        "every thing is high bro"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Rudy Morales",
      "comments": [
        "Finance bros running defense even tho this is the same platform he ran on in 2016 where studies showed that the tariffs in question only helped the rich and the working class suffered"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Rurth",
      "comments": [
        "The US doesn’t have the labor force, so it doesn’t matter many many factories you bring here. Also, modern factories will use robots and AI to mitigate labor costs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ryan Hayes",
      "comments": [
        "a bigger stronger middle class is what we need and tariffs will help move manufacturing back to the us."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ryan Lee",
      "comments": [
        "You missed the point that local supply chain local production line cannot be built overnight over a month over a year. How long are the public building to wait for the local industry to get ready?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ryan.S",
      "comments": [
        "High tariff proposals are a way for our administration to negotiate better trade terms with other countries."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ryanh_131",
      "comments": [
        "You need to look up the definition of inflation….."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Ryanpta",
      "comments": [
        "There should be no tax credits for buying an electric car"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "S. Maran",
      "comments": [
        "And the labor is cheaper because china devalues it's currency. This makes it impossible for American componies selling the same thing to stay in business. Tariffs level the playing field."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "S3x m4n",
      "comments": [
        "Yes but when we don't have the infrastructure or the workers to build and pay for these factories, all it does is race prices"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "SAHM/Toddlerlife/Pregnancy",
      "comments": [
        "There goes a Dollar Tree 😭I can barely afford anything now there's not even enough companies in America that can even run America without having Mexico and China import stuff here to feed us 😭"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Sam",
      "comments": [
        "Id be curious to know exactly what he wants to put tariffs on specifically."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Sam B3322",
      "comments": [
        "everyone is so fake. they complain about the high price of goods yet wants a tariff fooks"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Sappercell 31",
      "comments": [
        "Change spending habits, embrace some hardship to course correct the economy. Need to bring manufacturing back to America."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Seanathan",
      "comments": [
        "If it was cheap in enough to produce in USA, companies would of done it by now"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Sextilis",
      "comments": [
        "American workers won't accept cheap wages .. that's why factories are few in US"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Señor Miguel",
      "comments": [
        "If it helps get rid of income tax, it is awesome!!!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Shell",
      "comments": [
        "I love this take."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Sickagoose930",
      "comments": [
        "Tariffs were put on during his first term in office too…."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Sid..2021",
      "comments": [
        "Tariffs ONLY raise our cost IF there are no other options for purchasing those items. In reality the price only goes up to the next cheapest source for that product!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Simon Akers",
      "comments": [
        "Bro forgot to mention that a blanket tariff is bad on all fronts. His example for why tariffs were good was on a singular tariff on a single product. So trumps tariffs are bad. We import a lot of produce, we gonna suddenly start producing all these fruits and vegetables in the US. no we aren’t."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Sinquility",
      "comments": [
        "Domestic Manufacturing 🥳"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "SmokeThis",
      "comments": [
        "Very informative. Only thing I’d add is the danger of retaliatory tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Some dude",
      "comments": [
        "I want more Americans to have more access to better paying jobs. We shouldn’t do business with countries that have suicide nets around their dormitory filled factories."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "SpaceInsights",
      "comments": [
        "Why would the tariff encourage you to set up in America?? You'll get the credits vut the taxes,labor,equipment,licenses take all your margins??"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Stephen",
      "comments": [
        "excellent job describing tariffs. you failed to mention that tariffs are a powerful bargaining tool to make things happen in favor of the US. under Trump's first term, the threat of tariffs was enoug"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Steve The-Llama-Rama",
      "comments": [
        "🙄"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Storm",
      "comments": [
        "since Covid, many have not wanted to work/maintain their job in the u.s...as seen with many businesses bankrupted etc. Countries won't build here knowing this & Trump border issues"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Summer Nault",
      "comments": [
        "😁😁😁"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Suranne 🇬🇧🏴󠁧󠁢󠁥󠁮󠁧󠁿🇪🇺",
      "comments": [
        "or you get companies (like lindt) moving factories out of USA (to Europe) because they don't want to have their customers in Canada to pay tariffs on their products, meaning fewer jobs for Americans"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "T.u.d.k. 801",
      "comments": [
        "Where do you get all the ingredients to make the batteries America does not make enough steel as it is for your needs so where are you going to get the steel from?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "TK5234",
      "comments": [
        "UM.. Americans aren’t buying electric cars every day. All the appliances, furniture, some imported food and alcohol and majority of your purchases on Amazon are going up. To onshore this stuff is $$$"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "TTRAVELLER",
      "comments": [
        "A tariff is a national tax! It makes everything more expensive eg coffee & chocolate!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "TerryD",
      "comments": [
        "buy all American made and no problem."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "The Immigration Guy",
      "comments": [
        "Why anyone would want more expensive goods in exchange for a few more jobs in a country that has an extremely low unemployment rate is baffling."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "TheAztec",
      "comments": [
        "Sounds simple. But who is going to work at these factories? You? Your kids?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "The_ZeroHour",
      "comments": [
        "Those same companies are still gonna need to import material from outside the United States. It literally only benefits the rich people."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "TheotherGretch",
      "comments": [
        "Let’s just give Elon musk everything"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Therapon",
      "comments": [
        "the main issue is that if they do it day 1 on everything companies won't have time to change it will take years for them to pivot so it will hurt the everyday people"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tiara Jackson",
      "comments": [
        "😳😳😳"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Tiffany•Anderson",
      "comments": [
        "Labor over there is cheaper and inhumane"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tik Toker",
      "comments": [
        "The real question is \"How many jobs/ How much inflation?\"",
        "Employment rate isn’t the concern for a majority of Trumps voters. It’s inflation. They’re in for a major shock when the healthy inflation rate the Biden Admin. Is currently under goes up.",
        "I would add that if we put tariffs on China, China can also put Tariffs on us. Example look what happened to all those farmers and we had to bail them out."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tik tak toe",
      "comments": [
        "Tariff + corporate tax decrease = increase in incentive to buy American sourced goods to make more. Not a immediate company crushing tactic"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "TitoPengu",
      "comments": [
        "We also don't have competing companies for some of the things that we import, which just means higher prices."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tom Roberts",
      "comments": [
        "$25 American Tshirt and $15 china Tshirt will now be a $25 American Tshirt and $20 China Tshirt …"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tonyisc3po",
      "comments": [
        "gotta remember trumps plan is to decrease taxes on businesses AS WELL as raising tarrifs making it cheaper to produce products here in the United States"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tonysweet🇵🇭",
      "comments": [
        "Tariffs can be very good and can stimulate our economy but a blanket tariff would hurt the economy I don’t think trump ever said he wanted a blanket tariff"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Triay",
      "comments": [
        "Companies will not scramble to make their products in America"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tucker Paxson",
      "comments": [
        "qqqqqqqqqqqqq.",
        "😁😁😁",
        "😂😂😂"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Tuna",
      "comments": [
        "They ran on the platform of lower cost of living, not more jobs. So congrats, yall were lied to again."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "TyTalksLending",
      "comments": [
        "Good unbiased explanation!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Umair Zulfiqar",
      "comments": [
        "The car produced outside USA and inside USA don’t you think cost of labor and cost of getting parts there will differ and increase the end price too!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Uri",
      "comments": [
        "blanket tariffs BAD, no matter how you think of it from a consumer standpoint. the working class that voted for trump and in red states with lower incomes are fucking themselves."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "UsualSam",
      "comments": [
        "We don’t produce everything America or can’t produce that we import from other countries. For example, computer chips. We are finally building factories but it takes decades to build.We need trade atm"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "VOID",
      "comments": [
        "Also America doesn’t have the work force for minimum wage jobs like that, unless using immigrants"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Vanny G",
      "comments": [
        "Does over importing goods have an affect on national security? What would happen if China decided to not ship anything to the USA?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Vincent Bad Bear",
      "comments": [
        "no ody is going to build in America, too much restrictions"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "VonTroya Points",
      "comments": [
        "Maybe they don’t want to lol"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Walkingtothemoon",
      "comments": [
        "Talk about cases where where tarrifs have also led to fewer American jobs because of increased costs of resources needed for manufacturing and farming."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "WaterSpider",
      "comments": [
        "Avocados from Mexico abouta be $12"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Wayne",
      "comments": [
        "Does not matter how cheap something is if you don't have a job to afford it"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Will",
      "comments": [
        "Tariffs are going to destroy entire industries"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Wolfkub",
      "comments": [
        "it's a leverage move to get companies to move here and bring the business here and can also make those products cheaper. not to mention more jobs for Americans as well."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Yada Yada",
      "comments": [
        "Honestly, I want the USA to impose tariff to kill itself and accelerate decay and stagnation"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Yeo670719",
      "comments": [
        "👍"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "Yoga.By.Sarai",
      "comments": [
        "This was so helpful. Thank you!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "Zachary Frankenbach",
      "comments": [
        "Did his tariffs work during his first term?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "agentrio",
      "comments": [
        "But we literally can not grow things here. Bananas, coffee, cocoa, vanilla, etc (anything tropical). Not everything is manufactured. Specifically groceries aren’t! Prices will rise"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "ahhlover696",
      "comments": [
        "It's about being competitive",
        "Not even close to true when talking about industrial production"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "amber",
      "comments": [
        "The issue is that are we even sure these people who voted for him WANT Chinese companies establishing here?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "armenia goodell",
      "comments": [
        "The Byrd Ammendment. Senator Byrd devised the tariff system that really worked. Just like when the Democratic Party USED to work for the working people."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "asder",
      "comments": [
        "Usa will stay alone"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "bailey campbell",
      "comments": [
        "but doesn’t that mean that we generate more revenue and we are putting more money into our own economy rather than another countries which would make our economy in the end better"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "barb",
      "comments": [
        "This won't be good when it comes to prices for foods. Fruits and vegetables come from other countries. We will have to pay large Tarriffs for those countries and the produce will be so expensive!!!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "baycellone1234",
      "comments": [
        "It will bring businesses back here that is what will happen"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "beutifulplatapus",
      "comments": [
        "Oh so big oil past a tariff that would make electric cars more expensive to decrease sales in America"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "bggwop",
      "comments": [
        "No tarrifs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "booklovertrh",
      "comments": [
        "Doesn't it have to go through the proper channels before it gets approved? If it even gets approved?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "bot_hunt_bot",
      "comments": [
        "Ignoring the fact that targeted tariffs are what work. Country wide tariffs require a level of infrastructure and labor force that we flat out don't have so the potential benefit is largely impossible"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "brillo",
      "comments": [
        "why did inflation stay low when trump put and raised tariffs in his first term??"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "burnafterreading",
      "comments": [
        "They ASSEMBLE the cars here. They don't manufacture most all of the parts here."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "cagedbirdsinging",
      "comments": [
        "Not \"yes it can\" but YES IT WILL. Trumps plan WILL lead to MUCH higher costs of goods on top of already record high prices."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "cam • following",
      "comments": [
        "what about like small businesses?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "carlosthesimp",
      "comments": [
        "So are you basically saying that at the beginning things might be more expensive until people start manufacturing things here?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "certifiedconstitutionlover",
      "comments": [
        "Most fertilizer is improrted, coffee beans are imported, lots of alcohol is imported, oil is imported. Those are a few things they are going to get more expensive in the next 5 years"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "chefmtm",
      "comments": [
        "And the more we depend on imports, the more we suffer during supply chain disruption. Like Panama canal blocked and strikes."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "chikachika",
      "comments": [
        "but apple is not cheap"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "cid_beastly🔱",
      "comments": [
        "😍😍😍"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "cjsteph3",
      "comments": [
        "Trump imposed over 100 tariffs in his 1st term and we did not see a raise in inflation how can you explain that"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "courtneypants",
      "comments": [
        "So really it just all helps Elon"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "cruciferousvegetable",
      "comments": [
        "His own brand and his daughter’s brand of clothes are all made in China. 🙄"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "czander",
      "comments": [
        "And all I hear for reasons why they voted for Trump is they want affordable goods. They voted against their desire."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "d.k.0.1.5",
      "comments": [
        "We study history to see what works in societies as the survive and collapse. Grover Cleveland thrived on tariffs. Trump will see how he did it and do it and make it even better. Realize that people."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "danna shumpert",
      "comments": [
        "I don’t care about which side is right or wrong, what I know is last he was pres I felt like I had more money. I make 3x more now and I am living paycheck to paycheck. So what ever he did worked."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "datboilani.ttv",
      "comments": [
        "@ebb11234"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "dayalanyc",
      "comments": [
        "People on the left don’t think tariffs are bad. They think blanket tariffs that Trump is proposing are bad."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "dev9191",
      "comments": [
        NaN
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "digital.cam.era",
      "comments": [
        "putting tariffs on all imports would force companies to churn out american made goods but what happens when we are like at capacity with how many things we can produce. you don’t have infinite labor"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "dinosaur33322",
      "comments": [
        "If we place tariffs on imported goods that are significant enough, and for long enough to sufficiently encourage national production, would that inevitably reduce inflation,driving cost of goods down?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "dito",
      "comments": [
        "Sure, but you failed to talk about existing infrastructure. Which we don’t have. So who pays for the infrastructure, us or the companies?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "doorbell",
      "comments": [
        "Won't you use an example of what we import the most? I'd like to see what might affect us every day."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "duaneeweaver",
      "comments": [
        "Advice is do your own research instead of listening to what he’s telling you"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "elmerfga",
      "comments": [
        "Funny that you give the EV example, Musk, one of trumps champions) would definitely Benefit from tariffs. Making Tesla have a bigger market share"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "eyork66",
      "comments": [
        "You clearly don't know what Trump's tariff plan is. He's putting a tax on ALL imported goods, not just strategic industries. There is absolutely no argument for it. We can't make everything here"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "faith",
      "comments": [
        "goods will still have to go up from the price they are now though. the whole reason we make things in china is bc it’s cheaper so we would be avoiding the tariff yes, but it’s still more expensive-"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "fellers 2.0",
      "comments": [
        "It will force them to bring the work back to the u.s"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "flame",
      "comments": [
        "Ok but is trump going to keep electric vehicle tax credits?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "foolishgoat",
      "comments": [
        "A decade of expensive growing pains. The price of items manufactured in America will be very expensive because they wont have the immigrants that work for $7 an hour to do it. It’s a joke. But I’m on board if Americans learn that things made in America are going to be really expensive."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "g dawg",
      "comments": [
        "i’m centrist but this was genuinely the most unbiased video on this topic, thank you!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "gansito261",
      "comments": [
        "Many countries already have a comparative advantage in cost of labor, cost of raw materials, and manufacturing infrastructure. The US will suffer the transition not to mention the cost in trade wars"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "graciouslygrounded",
      "comments": [
        "So we can buy less and make more money? I’m in"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "gramsistired",
      "comments": [
        "SOME MANUFACTURING THAT WAS BROUGHT BACK IN 22 IS ALREADY LAYING WORKERS OFF"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "gurglingstomach",
      "comments": [
        "Thank you for a nuanced answer."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "hannah.phillips187",
      "comments": [
        "The problem is that there is absolutely no manufacturing infrastructure anymore and wages are too high. It would be more expensive to buy made in America products than to fit the bill for tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "hayden",
      "comments": [
        "😭😭😭"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "he11",
      "comments": [
        "These libs want rights for woman , but they don't care about children in these countries being slaves to make their cheap ass products to put on their face."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "holv26",
      "comments": [
        "Tariffs can be good on specific products but tariffs on ALL imported goods is a terrible idea"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "idreamofj",
      "comments": [
        "Excellent explanation!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "isaaccarter79",
      "comments": [
        "Trump enforced over 150 tariffs in his first administration and everyone kept seeing lower prices… because he did them right. Biden just threw them around and things got worse"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "jack",
      "comments": [
        "You can tell his bias beaded on the first 5 seconds of the video"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "jamesgreenwood594",
      "comments": [
        "WHAT ABOUT TRADE WARS?",
        "IT TAKES YEARS TP SET UP PLANTS IN US WHO WILL WORK ?YOU ARE DEPORTING ALL THE HELP A"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "jazzangels",
      "comments": [
        "America cannot manufacture every single thing"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "jenfhsveuf",
      "comments": [
        "Broadly painted tariffs will harm us bc we can’t just pop up infrastructure and resources in areas we don’t currently manufacture or produce."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "jessemc14",
      "comments": [
        "Biden was the one who put the tariff on them for the electric cars",
        "Trumps tariff will have us paying more for imported goods simple"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "jessiejamesfranco",
      "comments": [
        "Let’s talk about Buttered Sausage"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "joeyykinns",
      "comments": [
        "Yes but are you speaking of the effects of blanket tarrifs which is what he’s proposing?? Companies aren’t scrambling to build in the US their already preparing to raise prices for tarrifs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "juanvaldez4905",
      "comments": [
        "😫😫😫"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "kaov",
      "comments": [
        "The US doesn't produce many of the items tariffs will be put on."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "kashew",
      "comments": [
        "Will this affect the noodles I eat from China, like I literally eat them everyday"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "kennethnorris3",
      "comments": [
        "not a complete explanation. tariffs are not new. he didn't explain the tariffs that are already in place from both sides."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "kharrison2497",
      "comments": [
        "It will take decades to shift manufacturing back into the USA"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "kjm4567",
      "comments": [
        "But Biden increased tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "laurennnn512",
      "comments": [
        "Forget all your “Amazon finds” and good luck paying for them, they’re all Chinese"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "marco",
      "comments": [
        "Not to mention the fact the the quality of the product will be significantly greater in the US than in these other countries. Eventually when these facilities are built in the US prices will go down"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "mariasabo495",
      "comments": [
        "It's a catch 22... Tariff's wouldn't be so bad if everything wasn't so expensive right now"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "mattl928",
      "comments": [
        "Silly question: Can tariffs apply to services and not just products? For example, to help keep AI and software development jobs in US from being outsourced to India?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "meb1982melon",
      "comments": [
        "Do you hear yourself? It will take years of higher prices to catch up 🤦‍♀️"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "mgm202020",
      "comments": [
        "You have to look at the big picture. You will also be paying less taxes especially if Trump eliminates income tax. Things will cost slightly more but you will have alot more money. And more jobs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "miabucho",
      "comments": [
        "So at in the end we the people are the one that get screwed over! We have to settle with the high end cars"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "militaryVETmom1990",
      "comments": [
        "What are good vehicle companies vehicle wise here?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "nathanielsalaun",
      "comments": [
        "tarrifs on certain things. fine. if I'm not wrong he wants to do roughly 10-25% on all imported goods no?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "parker at the gym",
      "comments": [
        "We don’t have the infrastructure to support the disaster this will cause"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "pete.m836383",
      "comments": [
        "Economy will tank under Trump. Many economists agree with that. Reason Trump won was due to fact manipulation and hatred. Trump voters wouldn’t want to admit that."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "peterdavid2009",
      "comments": [
        "Nailed It."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "phillipk22",
      "comments": [
        "This should of stopped a long time ago we allowed child labor and major pollution and business man greed"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "politicalheathen",
      "comments": [
        "Well considering the very real possibility that those labor jobs will most likely not provide a livable wage, cheaper products are better."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "punchingkitten",
      "comments": [
        "Too crude generalizations. Not just labor,it’s years of dedicated infrastructure investment and consistent industrial policies that lowered Chinese manufacturing cost. Chinese labor are not cheap."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "robertovillarre667",
      "comments": [
        "USA have manufacturing companies all over the world. so he will put tariffs on himself."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "ronni",
      "comments": [
        "I’m a center-right economics-wise, and honestly, I have no idea why the right is just now starting to support tariffs, we’ve always disliked tariffs. The issue with UNIVERSAL tariffs is that some products just CANNOT be made here. So companies will not be moving to the USA, which means the consumers will HAVE to pay the tariff prices. For example, semiconductors and chips. Taiwan is the biggest player in these industries and holds many many advanced manufacturing tech centralized in Taiwan that can’t be easily relocated to the USA."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "shollier5",
      "comments": [
        "Tis a fine line between American jobs & lower product prices. It is almost a tightrope walk attempting to balance the 2 in the interest of the American ppl. But look what NAFTA did. Not good for US j"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "silentphilosopher",
      "comments": [
        "So when the corporations get their huge tax cuts, are they going to lower their costs on products to offset the costs of the tariffs? That would help balance it out. Or, are they going to pocket the extra tax money, keep prices the same and then add onto that already high price the 20-60% tariff?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "smk",
      "comments": [
        "it is highly, very, extremely unlikely for manufacturers to return to the US, even if tariffs is above 100%"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "some_thing843915",
      "comments": [
        "Tariffs aren’t perfect but they are a lot better than taxes because they push some of the economic burden on foreign nations rather than the United States taking it all on ourselves."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "soul_monk",
      "comments": [
        "the problem with Trump supporters & Conservatives is that they're complaining about how much stuff costs now...and unemployment is doing good at the present"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "stellathekatt",
      "comments": [
        "Tariffs + deportation = depression that’s it no need to yap for minutes on end"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "sunst8ofmind",
      "comments": [
        "Couple this with getting rid of the federal income tax and it’s a wash but with more American jobs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "texasfire1991",
      "comments": [
        "Good. Make America self sufficient again. We’ve been taken advantage of for far too long"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "theedwardferrel",
      "comments": [
        "Bottom line…corporations taking advantage of the masses. Period."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "theonewes",
      "comments": [
        "It’s not just cost of labour but market efficiency and expertise. Two markets can have the same labour cost but one market is more efficient… the US can’t compete with the world any more"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "thestreaming_godz",
      "comments": [
        "Y'all gonna drill more oil and gas.. So, IMO, it will be the billionaire again that will win here.. Anyways.. Hope it will. Manifest to the middle and lower class"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "timdrake78",
      "comments": [
        "Love that u use electric cars as an example 🤣😂🤣 Elon really has brainwormed Americans"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "tonyte8008",
      "comments": [
        "Take it a step further, what happens when there are more American Jobs and more money to spend?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "topeagle66",
      "comments": [
        "America cant produce cheap enough even with tariffer. if u want America to produce the product the price go up 1000% and no one have afford to buy it. because of higher prices on worker"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "tori_bickett",
      "comments": [
        "😳😳😳"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "trailerparkworkshop",
      "comments": [
        "You're using specific tarifs to analyze broad tarifs. Either you're not thinking critically or you're intentionally being misleading as the last time we enacted broad tarifs was Smoot Hawley Tariff"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "traveljeungkies",
      "comments": [
        "More American jobs sounds good to me 🥹"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user385338347",
      "comments": [
        "🥰"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "user4304289061018",
      "comments": [
        "😳😳😳"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "user442177488752",
      "comments": [
        "the left was all about paying more for a whopper if the employee got more pay. so they should also be ok with paying more if more Americans get jobs."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user4695101002403",
      "comments": [
        "Idc about other people’s jobs. I care about my job and the cost of stuff being low. I still don’t get tariffs!!!!"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user5851582932919",
      "comments": [
        "Question is that the in many cases, poor country will use the tariff to protect their industry to catch up, rich country usually use tariff to stay comfortable, one day these industries will bankrupt"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user5901792268873",
      "comments": [
        "it will take a long while to produce everthing here so we just suffer in the meantime?",
        "how does this even help to have more jobs here but everything is expensive?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user674991",
      "comments": [
        "Blanket tariffs and mass deportations won’t happen. His billionaire funders won’t let it. It was election lies to win votes like building the wall was in 2016."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user6986542475102",
      "comments": [
        "What companies are scrambling ???"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user739598074133",
      "comments": [
        "Hopefully to pay for the tax cuts he is talking about. Tax cuts on the rich, no tax on tips, no tax on overtime, no tax on social security…all mean cuts to social security benefits in the future…"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user7429233999835",
      "comments": [
        "Tariffs are bad because once tariffs go up, the other side puts one up. Then it takes time to renegotiate it down. This will drive up cost and lock in new price floors. This is horrible."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user776580808032",
      "comments": [
        "The funny thing about this new narrative is trump literally had tarrifs implemented the first time. Biden kept and even expanded them. This isnt new"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user7949014615533",
      "comments": [
        "America isn’t built to manufacture things. Where are you going to find workers in America for cheap labor? Chinas avg is at $5.50/hr"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user8186952800774",
      "comments": [
        "Tariffs are but a small part of a larger economic strategy. As are tax rates, you can’t look at one individual part of a plan and say it’s good or bad."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user8354246187667",
      "comments": [
        "😁😁😁"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "user8477830159315",
      "comments": [
        "thanks for actually explaining both sides to those that stayed for the whole video"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "user9928519114838",
      "comments": [
        "Trump ended up paying more than $12 billion in bailouts to U.S. farmers when China stopped importing from them in retaliation for tariffs - there can be many consequences including trade wars"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "username..unknown3",
      "comments": [
        "He forgot free market economy, if imports cost $50 and US made cost $35 , i don’t know about you but im buying US made $35"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "vaex",
      "comments": [
        "Oh I get it! So they bring companies back to the us and the price goes up, or they pay the tariff and the price goes up! So glad we all thought this through 😅"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "vohsy1216",
      "comments": [
        "A blanket tariff is not good because no country is going to produce every single thing",
        "That would explode our debt and be the greatest transfer of wealth to the upper class from the low and middle class. Wealthy people would pay so much less in taxes"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "vpr",
      "comments": [
        "shutup you wrong"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "white_whale93",
      "comments": [
        "the big thing to think about, is tariff increases is a long term solution. like you said prices are going to increase at the beginning. but once those companies come here they will level out."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "www.comeuntochrist.org",
      "comments": [
        "It's more expensive on the short term yes, but eventually companies figure out how to make it a very cheap process."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "yellowjacket",
      "comments": [
        "this is the problem with EVERYTHING, people think an issue is THIS or THAT and it actually depends on the situation."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "zombie__low",
      "comments": [
        "America can’t physically make everything in America. We don’t have enough land, and we don’t want to pay Americans anyways lol"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "матвей кузякин",
      "comments": [
        "blanket tarriffs are very different from targeted tarriffs lol."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "♡",
      "comments": [
        "Biden added onto trumps tariffs"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "✨️ InfiniteSpiritualwarrior✨️",
      "comments": [
        "💯"
      ],
      "language": "Other",
      "pure_emoji": true
    },
    {
      "user": "ッ 🎃",
      "comments": [
        "The business I work for in Canada already started building warehouses they planning on importing everything they need for the next 4 years"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "𝓖𝓮𝓸𝓻𝓰𝓮𝓝𝓬𝓸𝓰𝓷𝓲𝓽𝓸 ✍",
      "comments": [
        "hope this helps"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "🆘🇺🇲Judith Riblett",
      "comments": [
        "where are you getting the labor force for these new facilities?"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "👑🍀🦋",
      "comments": [
        "You forgot to mention the almost guaranteed retaliatory tariffs the U.S. will face and how that will result in mass layoffs and closures of American factories"
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "💙ğhĕñğ-ğhăñğ-ğhöĺĺïĕ💙",
      "comments": [
        "so American consumers lose either way , you get more jobs eventually. but those wages will have to pay for more expenses items. and the cost of new tooling is going to increase prices too."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "😀love me or hate me😎",
      "comments": [
        "It is product dependend. And it will always be a cost/benefit Calc."
      ],
      "language": "English",
      "pure_emoji": false
    },
    {
      "user": "🧐",
      "comments": [
        "no one is buying crap from China for more then it's worth 😂 they will be forced to sell for cheaper (pay tarrifs) because the US is biggest consumer base in the world they NEED us not the other way🤷"
      ],
      "language": "English",
      "pure_emoji": false
    }
  ]
}